================
Character Escape
================

example.com

respond "\"hello"

root * /var/www

---

(source_file
	(sites
		(single_site
			(site_address)
			(directive
				(directive_name)
				(interpreted_string_literal
				(escape_sequence)))
			(directive
				(directive_name)
				(matcher)
				(argument)))))

====================
Status Code Fallback
====================

example.com

try_files {path} {path}/ /index.html =404

---

(source_file
	(sites
		(single_site
			(site_address)
			(directive
				(directive_name)
				(placeholder)
				(placeholder)
				(argument)
				(argument)
				(status_code_fallback)))))

==================
replaceVars Syntax
==================

example.com

root * @longhorn-ui@/share/share/lib/longhorn-ui

---

(source_file
	(sites
		(single_site
			(site_address)
			(directive
				(directive_name)
				(matcher)
				(argument)))))

=======================
Domain with Underscores
=======================

example.com

reverse_proxy some_other_host:1234

---

(source_file
	(sites
		(single_site
			(site_address)
			(directive
				(directive_name)
				(argument)))))
